Revit 2027 API
BuiltInFailures.StairRampFailures.CannotGenerateFacesError Property
 Couldn't generate surfaces for stairs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotGenerateFacesError { get; }
Public Shared ReadOnly Property CannotGenerateFacesError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotGenerateFacesError {
	FailureDefinitionId^ get ();
}
static member CannotGenerateFacesError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace